package backweb.a02_object;

public class A03_StaticArray {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*
# 자바의 배열
1. 자바는 고정된 배열을 사용하여 한번에 크기가 정해진 내용으로
2. 보다 빠르게 읽기를 처리할 수 있게 한다.
3. 배열도 객체에 속해 있으므로, 객체의 생성 방식에 준해서 처리한다.
4. 배열의 선언/생성/활용
	1) 배열의 선언
	 	타입[] 배열명;
	 	어떤 유형인지 선언한다. 타입에는 기본데이터유형을 비롯하여,
	 	String, 클래스유형, 내장객체유형등 여러가지 선언이 가능하다.
	 2) 배열의 초기화
	 	배열도 객체이기에 기본적으로 초기화하여야지 호출하여 사용할 수 있다.
	 	객체가 데이터를 할당하지 않을 때, null로 선언하듯이 null로 초기화할 수 있다.
	 3) 배열의 데이터 할당.
	 	- 배열의 heap영역에 데이터가 없는 배열과
	 		ex) int[] arr = new int[5];
	 		    배열의 선언과 heap영역할당 처리, 데이터는 넣지 않았음.
	 	- heap영영엑 데이터를 넣은 할당을 할 수 있다.
	 		ex) String[] arr2 = new String[]{"사과","딸기","오렌지"};
	 		ex) String[] arr3 = {"사과","딸기","오렌지"};
	 		위와 같이 선언과 동시에 할당하는 것은 위 두가지 형식 모두가 허용을 한다.
	 		
	 		
	 		
	 		
	 		
	 
*/
	}

}
