package backweb.z01_homework;

import com.google.gson.Gson;

public class A0418 {

	public static void main(String[] args) {
		Gson g = new Gson();
		// TODO Auto-generated method stub
//		## 자바 관련 실습문제
//
//		1. 자바에서 `int`, `double`, `char` 자료형을 사용하여 각각 변수를 선언하고 초기화하는 코드를 작성하세요.
//		2. `String` 객체와 기본 자료형 `int`를 사용하여 이름과 나이를 저장하는 변수를 선언하고 초기화하세요.
//		3. 배열을 사용하여 1부터 10까지의 정수를 저장하고 이 배열의 모든 원소를 출력하는 프로그램을 작성하세요.
//		4. `var` 키워드를 사용하여 자바의 타입 추론 기능을 시연하는 코드 예제를 작성하세요. 변수 하나는 숫자를, 다른 하나는 문자열을 할당받도록 합니다.
//		5. `Scanner` 클래스를 사용하여 사용자로부터 입력받은 두 수의 합을 계산하고 출력하는 프로그램을 작성하세요.
//		6. `String` 사용하여 주어진 세 개의 도시 이름을 저장하고, 출력하는 프로그램을 작성하세요.
//
//		## 토론할 자바 관련 문제
//
//		1. `var` 키워드 도입이 자바 프로그래밍에 미치는 장단점에 대해 토론하세요.
//		2. 자바에서 기본 자료형과 참조 자료형 사이의 차이점에 대해 설명하고, 각각의 사용 상황을 예로 들어 토론하세요.
//		4. 자바의 메모리 관리 방법에 대해  토론하세요.
/*
 * 
# 진행순서
1. 점검사항(~16:00)전달
2. 토론과제/개인과제 진행
3. 조별프로젝트형 과제 진행(~17:00)
	- 조별 일일 진행 내용 전달
참고) frontweb\doc\daily\0416.txt 참고
5. 이번 프로젝트는 전체적으로 점검하면 진행하고, 효과적으로 진행되는 내용
	확인해서 자체에서 진행되게 처리
	월	사이트결정, 일정계획/역할분담, 워크플로우 시작, 
		툴결정-workflow
	화	요구사항-대범위/워크플로우확인 및 작성
		엑셀 및 ppt 기본양식 결정 및 작성완료
	수  요구사항-세부범위/워크플로우확인/화면설계서 작성시작
	목  진행된 내용 발표 ppt작성 완성
	금	1차발표(요구사항분석, 워크플로우, 화면설계50%) 
	==> 각 조별로 진행된 내용을 조별로 17:00까지 전달해주세요.. 
 */
	}

}
