package backweb.z01_homework;

public class A0422 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
/*
### 연습문제

1. `java FruitShop 사과 100 5`라는 명령어를 사용했을 때, `main` 메서드에서 `args` 배열을 활용해 총 비용을 계산하는 Java 코드를 작성하세요.
2. `java WeatherForecast 비 오늘` 명령어가 입력되었을 때, 이를 처리하는 Java 프로그램을 작성하세요. 입력된 날씨와 요일을 출력하고, 날씨에 따라 다른 활동을 추천하는 메시지를 출력해 보세요.
3. Java 프로그램을 작성하여 사용자로부터 세 개의 정수를 입력받아 평균을 출력하도록 하세요. `Scanner` 객체를 사용해야 합니다.
4. 조건문과 반복문을 이용하여 1부터 사용자가 입력한 숫자까지의 소수(Prime number)들을 모두 출력하는 Java 프로그램을 작성하세요.
5. 사용자로부터 이름과 나이를 입력받아, 입력된 나이에 따라 다른 인사말을 출력하는 Java 프로그램을 작성하세요. 예를 들어, 20세 미만이면 "안녕 친구!", 20세 이상이면 "안녕하세요!"를 출력합니다.
6. `Scanner`를 사용하여 사용자로부터 연도를 입력받고, 입력된 연도가 윤년인지 아닌지를 판단하여 출력하는 Java 프로그램을 작성하세요.
7. 자바의 Math.random() 를 사용하여 두 팀이 주사위를 던져 높은 수를 얻은 팀이 승리하는 게임을 만드세요. 각 팀은 주사위를 두 번씩 던지며, 최종 점수를 계산하여 승자를 결정합니다.
8. 사용자로부터 10개의 정수를 입력받아, 그 중 최대값과 최소값을 찾아 출력하는 Java 프로그램을 작성하세요.

### 토론 과제

1. 자바 프로그램에서 사용자 입력을 처리하는 `Scanner`와 String args[] 차이점은 무엇이며, 어떤 상황에서 각각을 선호하게 될까요?
2. 명령줄 인자를 사용하는 프로그램의 장점과 한계는 무엇이라고 생각하시나요? 

# 다음의 각 내용에 대하여 개인별로 점검하시고, 내일 발전할 내용도 적어주세요.(조장님이 취합해서 전달)
1. 오늘 출결사항(전날, 9:00 지각/조퇴사유), 수업시간 이동 및 준수
	지각/결석시 사전에 연락 했는지? 
2. 수업에 긍정적인 마음으로 집중하였는가?
   	1) 수업시간에 수업관련 없는 채팅이나 동영상 등 방해되는 내용을 접하지 않았는가?
   	2) 수업시간에 효과적으로 집중을 하였는가?
3. 수업 진행 중, 어려웠던 내용과 해결해야할 과제.
# 조별로 공통적으로 이해가 힘든 내용이나 어려운 내용 정리해서 전달해주세요.
# 수업관련 건의사항이 있으면 전달 부탁드립니다.

# 진행순서
1. 점검사항(~16:00)전달
2. 토론과제/개인과제 진행(~17:30)전달
   개인과제는 개별로 전달(1차로 전달 후)
3. 조별프로젝트형 과제 진행
  - 조별 일일 진행 내용 전달(~17:00)  
 
 */
	}

}
